{
  "settings": {
    "size": "xl"
  },
  "dictionary": [
    {
      "Прошло много времени с тех пор как джаваскрипт стал мейнстримом": "Long time passed since JavaScript become mainstream."
    },
    {
      "Не смотря на многочисленные попытки, до сих пор нет единственного правильного пути написания кода в этом языке.": "Despite multiple attempts, there is still no right single way to write code in this language."
    },
    {
      "Каждый использует его своим специальным способом и многи люди все еще думают, что они не смогли укротить этот язык.": "Everybody is using it in their own special way and most people still fill that they are failing to tame the language."
    },
    {
      "Посмотри на этот код. Ты не знал этого. Я знаю, поэтому я умнее тебя.": "Look at that code. You did't know that. I know so I am smarter then you."
    },
    {
      "Все эти разговоры немного скучные потому, что бесполезные.": "All this talks are kinda boring, because they are not very useful."
    },
    {
      "Моя речь будет такой же но я хочу принести вам весть.": "My talk will be sort of similar but I want to bring a message to you."
    },
    {
      "Я расскажу вам, как я придумал идею говорить о языке Javascript.": "I'll tell you how I came up with idea to talk about javascript language."
    },
    {
      "Я знаю много языков. Паскаль, С++ и наконец перешел к джфваскрипт.": "I know many languages. Pascal, C++ and finally jumped to javascript."
    },
    {
      "У меня было очень хорошее понимание того, как JavaScript-код должен быть написан. И я был совершенно неправ.": "I had very good understanding of how the javascript code should be written. And I was completely wrong."
    },
    {
      "Javascript ударил меня в спину много много раз, прежде чем я наконец понял": "Javascript hit me in back many many time before I finally understood."
    },

    {
      "Но даже теперь я не уверен, что понимаю даваскипт полностью.": "But even now I am not sure that I understood javascript completely."
    },
    {
      "Кто здесь думает, что знает Javascript очень хорошо?": "Who is there thinking know javascript very well?"
    },
    {
      "OK. Пара заблуждающихся человек. Но большинство людей не так уверенно.": "Ok. The couple misguided people. But most people are not so confident."
    },
    {
      "Я хочу, чтобы вы подумали... Остановитесь на минутку. Забудьте о react и angular. Подумайте о чистом JavaScript.": "What I want you to think... Stop for a moment. Forget about react and angular. Think about pure javascript."
    },
    {
      "Каким он должен быть? Что такое правильный способ написания JavaScript.": "What it should be like? What is the proper way of javascript."
    },
    {
      "Javascript очень гибкий, как вы знаете. Мы могли бы написать код многими способами.": "Javascript is very flexible as you all know. We could write code in many different ways."
    },
    {
      "И я здесь не для того, чтобы научить вас правильно писать Javascript. Нет правильного пути.": "And I am not here to teach you how to write javascript the right way. There is no right way. "
    },
    {
      "Те, кто не знает, что они ходят во тьме, никогда не будут искать света.": "Those who are unaware they are walking in darkness will never seek the light."
    },
    {
      "Я хочу сказать, что JavaScript-это Брюс Ли из языков программирования. Потому что он гибкий, он мощный и он изменил всю картину.": "I'd like to say that javascript is Bruce Lee of programming languages. Because it's flexible, it's powerful and it changed the hole picture."
    },
    {
      "Я хочу (своего рода) указать вам на некоторые вещи, которые вы, возможно, не видели раньше или, может быть, не думали о них.": "I want to (sort of) point you to some of the things that you may be haven't seen before or maybe didn't think about them"
    },
    {
      "1": "2"
    }
  ]
}

